#### Bibliotecas

In [2]:
# pandas

# Primeira coisa é entrar no site da biblioteca e procurar algo como getting started, quickstart, e estudar os principios basicos
# Por exemplo, vamos seguir a pagina getting started do pandas
# Link: https://pandas.pydata.org/docs/getting_started/intro_tutorials/01_table_oriented.html#min-tut-01-tableoriented

import pandas as pd

df = pd.DataFrame({
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    })

df

# pd.DataFrame -> recebe um dicionario como parametro e cria a tabela a partir do dicionario

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [6]:
display(df['Age'])
# another option is create a new collumn (or Series)

ages = pd.Series([22, 35, 58], name="Age")
display(ages)

0    22
1    35
2    58
Name: Age, dtype: int64

0    22
1    35
2    58
Name: Age, dtype: int64

In [ ]:
# requests

#PyPI - project links na barra lateral
# Read the docs -> documentação
# Github -> READ.ME

#### Funções Específicas

In [24]:
# datas no pandas

df = pd.read_excel('Contratos.xlsx')
display(df)

    Cliente Data Pagamento Data Pagamento 2
0    Fulano     22/09/2022         09-22-22
1  Beltrano     17/04/2022         04-17-22
2   Ciclano     21/02/2022         02-21-22
3      Lira     27/12/2022         12-27-22
4     Julia     01/02/2022         02-01-22
5    Marcus     08/07/2022         07-08-22
6    Amanda     28/09/2022         09-28-22
7   Larissa     28/05/2022         05-28-22
8      Alon     06/10/2022         10-06-22

In [27]:
# pesquisando tipo do dado no dataframe
print(df.info()) # repare que object é um tipo igual a string...

# convertendo a coluna Data Pagamento para tipo data
df['Data Pagamento'] = pd.to_datetime(df['Data Pagamento'], format='%d-%m-%y')
df['Data Pagamento']

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Cliente           9 non-null      object
 1   Data Pagamento    9 non-null      object
 2   Data Pagamento 2  9 non-null      object
dtypes: object(3)
memory usage: 348.0+ bytes
None

C:\Users\renat\AppData\Local\Temp\ipykernel_14656\844868400.py:5: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['Data Pagamento'] = pd.to_datetime(df['Data Pagamento'])

0   2022-09-22
1   2022-04-17
2   2022-02-21
3   2022-12-27
4   2022-02-01
5   2022-07-08
6   2022-09-28
7   2022-05-28
8   2022-10-06
Name: Data Pagamento, dtype: datetime64[ns]

In [28]:
# funcao merge do pandas

df2=pd.read_excel('Emails.xlsx')
display(df2)

df = df.merge(df2, left_on='Cliente', right_on='Nome')
display(df)

       Nome               Email
0    Fulano    fulano@gmail.com
1  Beltrano  beltrano@gmail.com
2   Ciclano   ciclano@gmail.com
3      Lira      lira@gmail.com
4     Julia     julia@gmail.com
5    Marcus    marcus@gmail.com
6    Amanda    amanda@gmail.com
7   Larissa   larissa@gmail.com
8      Alon      alon@gmail.com

    Cliente Data Pagamento Data Pagamento 2      Nome               Email
0    Fulano     2022-09-22         09-22-22    Fulano    fulano@gmail.com
1  Beltrano     2022-04-17         04-17-22  Beltrano  beltrano@gmail.com
2   Ciclano     2022-02-21         02-21-22   Ciclano   ciclano@gmail.com
3      Lira     2022-12-27         12-27-22      Lira      lira@gmail.com
4     Julia     2022-02-01         02-01-22     Julia     julia@gmail.com
5    Marcus     2022-07-08         07-08-22    Marcus    marcus@gmail.com
6    Amanda     2022-09-28         09-28-22    Amanda    amanda@gmail.com
7   Larissa     2022-05-28         05-28-22   Larissa   larissa@gmail.com
8      Alon     2022-10-06         10-06-22      Alon      alon@gmail.com

#### APIs

In [29]:
# datetime
from datetime import datetime

hoje = datetime.now()
print(hoje)

2024-04-18 11:18:59.550557

In [ ]:
# documentação de APIs cada uma é diferente da outra, 
# vejam o módulo de API que eu faço vários exemplos lá

# exemplo sandbox https://dadosabertos.bcb.gov.br/dataset/dinheiro-em-circulao

# exemplo documentação: https://www.alphavantage.co/